export const questions = [
  {
    id: 0,
    text: "Привет! Я помогу рассчитать справедливое распределение долей между партнёрами. Этот тест занимает 5–7 минут.",
    options: [
      { label: "Да, поехали", next: 1 },
      { label: "Что за метод?", next: 99 }
    ]
  },
  {
    id: 1,
    text: "Сколько вас в партнёрстве (вместе с тобой)?",
    options: [
      { label: "2 человека", next: 2, partners: 2 },
      { label: "3 человека", next: 2, partners: 3 },
      { label: "Больше 3", next: 100, partners: 4 },
    ]
  },
  {
    id: 100,
    text: `Тест рассчитан максимум на трёх участников.
Если вас больше, расчёт проводится индивидуально с Артёмом.`,
    options: []
  },
  {
    id: 99,
    text: `Метод основан на модели трёх капиталов партнёрства:

- экономический, человеческий и социальный.

Каждый участник оценивает значимость трёх капиталов для конкретной бизнес-модели (в сумме 100%).

Например: для производства - выше вес экономического капитала, для консалтинга - человеческого.

Далее оценивается участие партнёров в каждом капитале - для каждого капитала партнёры распределяют между собой доли участия (в сумме 100%).

Если несколько респондентов, результаты усредняются.`,
    options: [{ label: "Понятно, поехали", next: 1 }]
  },
  {
    id: 2,
    text: "Ты решаешь задачу по действующему партнёрству или только планируешь его?",
    options: [
      { label: "Действующее партнёрство", next: 21 },
      { label: "Планируемое партнёрство", next: 22 },
    ]
  },
  {
    id: 21,
    text: "Что больше всего беспокоит сейчас?",
    options: [
      { label: "Доли не отражают вклад", next: 3 },
      { label: "Неясно, как учесть зарплату и время", next: 3 },
      { label: "Инвестор внёс деньги - как корректировать", next: 3 },
      { label: "Конфликты в решениях", next: 3 },
    ]
  },
  {
    id: 22,
    text: "Что волнует на старте?",
    options: [
      { label: "Как честно поделить доли", next: 3 },
      { label: "Кто что вносит и как учесть", next: 3 },
      { label: "Как не застрять в 50/50", next: 3 },
      { label: "Как обсуждать роли и ожидания", next: 3 },
    ]
  },
  {
    id: 3,
    text: "Выбери, какая модель ближе к вашей - это поможет задать стартовые веса капиталов:",
    options: [
      { label: "Производство / ритейл ", next: 4 },
      { label: "Консалтинг / услуги", next: 4 },
      { label: "IT / SaaS", next: 4 },
      { label: "Офлайн-сервис", next: 4 },
    ]
  }
];